// origins
export const trsNames = {
    "t1": "Відсутні або наявні нереалістичні чи неоціненні функціональні характеристики ПЗ",
    "t2": "Відсутні або наявні нереалістичні чи неоціненні характеристики якості ПЗ",
    "t3": "Відсутні або наявні нереалістичні чи неоціненні характеристики надійності ПЗ",
    "t4": "Відсутні або наявні нереалістичні чи неоціненні рекомендації щодо майбутньої застосовності ПЗ",
    "t5": "Відсутні або наявні нереалістичні чи неоціненні характеристики часової продуктивності ПЗ",
    "t6": "Відсутні або наявні нереалістичні чи неоціненні рекомендації щодо майбутньої супроводжуваності ПЗ",
    "t7": "Відсутні або наявні нереалістичні чи неоціненні пропозиції щодо повторного використання компонент ПЗ"
}
export const crsNames = {
    "c1": "Присутні обмеження щодо сумарного бюджету на реалізацію програмного проекту",
    "c2": "Вказана недоступна вартість реалізації програмного проекту",
    "c3": "Присутній низький ступінь реалізму при оцінюванні витрат на програмний проект"
}
export const prsNames = {
    "p1": "Відсутні або наявні нереалістичні чи неоціненні властивості та можливості гнучкості внесення змін до планів життєвого циклу розроблення ПЗ",
    "p2": "Відсутні або наявні нереалістичні чи неоціненні можливості порушення встановлених термінів реалізації етапів життєвого циклу розроблення ПЗ",
    "p3": "Присутній низький ступінь реалізму при встановленні планів і етапів життєвого циклу розроблення ПЗ"
}
export const mrsNames = {
    "m1": "Відсутні або наявні нереалістичні чи неоціненні стратегії реалізації програмного проекту",
    "m2": "Відсутні або наявні нереалістичні чи неоціненні методики планування проекту розроблення ПЗ",
    "m3": "Відсутні або наявні нереалістичні чи неоціненні методики оцінювання програмного проекту",
    "m4": "Відсутнє або наявне неналежне документування етапів реалізації програмного проекту",
    "m5": "Відсутні або наявні нереалістичні чи неоціненні методики прогнозування результатів реалізації програмного проекту"
}

// potential
export const trNames = {
    "t1": "Затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ",
    "t2": "Затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ",
    "t3": "Небажання команди виконавців ПЗ використовувати інструментальні засоби для підтримки процесу розроблення ПЗ",
    "t4": "Відмова команди виконавців від CASE-засобів розроблення ПЗ",
    "t5": "Формування запитів на більш потужні інструментальні засоби розроблення ПЗ",
    "t6": "Недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ",
    "t7": "Програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості",
    "t8": "Неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ",
    "t9": "Неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ",
    "t10": "Швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів",
    "t11": "Поява дефектних системних компонент, які використовують для розроблення ПЗ"
}
export const crNames = {
    "c1": "Недооцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)",
    "c2": "Переоцінювання витрат на реалізацію програмного проекту (надмірно висока вартість",
    "c3": "Фінансові ускладнення у компанії-замовника ПЗ",
    "c4": "Фінансові ускладнення у компанії-розробника ПЗ",
    "c5": "Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації",
    "c6": "Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації",
    "c7": "Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ",
    "c8": "Реорганізація структурних підрозділів у компанії-замовника ПЗ",
    "c9": "Реорганізація команди виконавців у компанії-розробника ПЗ",
}
export const prNames = {
    "p1": "Зміни графіка виконання робіт з боку замовника чи виконавця",
    "p2": "Порушення графіка виконання робіт у компанії-розробника ПЗ",
    "p3": "Потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ",
    "p4": "Потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ",
    "p5": "Потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ",
    "p6": "Недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-розробника ПЗ",
    "p7": "Переоцінювання тривалості етапів реалізації програмного проекту",
    "p8": "Остаточний розмір ПЗ перевищує заплановані його характеристики",
    "p9": "Остаточний розмір ПЗ значно менший за планові його характеристики",
    "p10": "Поява на ринку аналогічного ПЗ до виходу замовленого",
    "p11": "Поява на ринку більш конкурентоздатного ПЗ"
}
export const mrNames = {
    "m1": "Низький моральний стан персоналу команди виконавців ПЗ",
    "m2": "Низька взаємодія між членами команди виконавців ПЗ",
    "m3": "Пасивність керівника (менеджера) програмного проекту",
    "m4": "Недостатня компетентність керівника (менеджера) програмного проекту",
    "m5": "Незадоволеність замовника результатами етапів реалізації програмного проекту",
    "m6": "Недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем",
    "m7": "Хвороба провідного виконавця в найкритичніший момент розроблення ПЗ",
    "m8": "Одночасна хвороба декількох виконавців підчас розроблення ПЗ",
    "m9": "Неможливість організації необхідного навчання персоналу команди виконавців ПЗ",
    "m10": "Зміна пріоритетів у процесі управління програмним проектом",
    "m11": "Недооцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ",
    "m12": "Переоцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ",
    "m13": "Надмірне документування результатів на етапах реалізації програмного проекту",
    "m14": "Недостатнє документування результатів на етапах реалізації програмного проекту",
    "m15": "Нереалістичне прогнозування результатів на етапах реалізації програмного проекту",
    "m16": "Недостатній професійний рівень представників від компанії-замовника ПЗ"
}

export const dividers = {
    rs: 18,
    r: 46
}